DIGRAPH_LAT2CYR = [
    ("g'", "ғ"), ("G'", "Ғ"), ("o'", "ў"), ("O'", "Ў"),
    ("sh", "ш"), ("Sh", "Ш"), ("SH", "Ш"),
    ("ch", "ч"), ("Ch", "Ч"), ("CH", "Ч"),
    ("ya", "я"), ("Ya", "Я"), ("YA", "Я"),
    ("yu", "ю"), ("Yu", "Ю"), ("YU", "Ю"),
    ("yo", "ё"), ("Yo", "Ё"), ("YO", "Ё"),
    ("ts", "ц"), ("Ts", "Ц"), ("TS", "Ц"),
]

LAT2CYR = {
    "a":"а","b":"б","d":"д","e":"е","f":"ф","g":"г","h":"ҳ","i":"и","j":"ж","k":"к","l":"л",
    "m":"м","n":"н","o":"о","p":"п","q":"қ","r":"р","s":"с","t":"т","u":"у","v":"в","x":"х","y":"й","z":"з",
    "A":"А","B":"Б","D":"Д","E":"Е","F":"Ф","G":"Г","H":"Ҳ","I":"И","J":"Ж","K":"К","L":"Л",
    "M":"М","N":"Н","O":"О","P":"П","Q":"Қ","R":"Р","S":"С","T":"Т","U":"У","V":"В","X":"Х","Y":"Й","Z":"З",
    "’":"ъ","'":"ъ"
}

CYR2LAT = {
    "а":"a","б":"b","д":"d","е":"e","ф":"f","г":"g","ҳ":"h","и":"i","ж":"j","к":"k","л":"l",
    "м":"m","н":"n","о":"o","п":"p","қ":"q","р":"r","с":"s","т":"t","у":"u","в":"v","х":"x","й":"y","з":"z",
    "А":"A","Б":"B","Д":"D","Е":"E","Ф":"F","Г":"G","Ҳ":"H","И":"I","Ж":"J","К":"K","Л":"L",
    "М":"M","Н":"N","О":"O","П":"P","Қ":"Q","Р":"R","С":"S","Т":"T","У":"U","В":"V","Х":"X","Й":"Y","З":"Z",
    "ў":"o'","Ў":"O'","ғ":"g'","Ғ":"G'",
    "ш":"sh","Ш":"Sh","ч":"ch","Ч":"Ch",
    "ц":"ts","Ц":"Ts","я":"ya","Я":"Ya","ю":"yu","Ю":"Yu","ё":"yo","Ё":"Yo","э":"e","Э":"E",
    "щ":"shsh","Щ":"Shsh","ь":"","Ь":"","ъ":"'","Ъ":"'"
}

def latin_to_cyr(text: str) -> str:
    out = text
    for a,b in DIGRAPH_LAT2CYR:
        out = out.replace(a, b)
    return "".join(LAT2CYR.get(ch, ch) for ch in out)

def cyr_to_latin(text: str) -> str:
    return "".join(CYR2LAT.get(ch, ch) for ch in text)
